{"pageContext":{"id":"59076cc1-f05d-5521-ace4-e22a1950771f","name":"Daniel Coulter Reynolds","position":"Lead vocalist","image":{"fluid":{"src":"//images.ctfassets.net/a7c41jx39mti/3QptfYgEFGIMmuSCYwMGEc/766c42852b49e5c3d58648bee5fb0a8f/Dan_Reynolds_2C_head_shot_2C_2018.jpg?w=400&q=50"}},"about":{"about":"  Reynolds was initially reluctant to become a professional musician, partially because future bandmate Wayne Sermon had once told him: \"Don't do music because you want to do music - do music if you have to do music\". After he began attending Brigham Young University, Reynolds found that he could not \"do anything else\" and committed fully to a professional music career. In Utah, Reynolds met and recruited drummer Andrew Tolman to form Imagine Dragons. With Reynolds as lead vocalist, Imagine Dragons won BYU's \"Battle of the Bands\" and other local competitions. Bassist Ben McKee joined the band in Las Vegas and after Tolman's departure 2011 invited Daniel Platzman, also a friend of Wayne's from Berklee College of Music, to play drums, thus completing the group's current lineup. The band relocated to Las Vegas, where they began performing almost nightly as a lounge act. It was there in 2010 that they caught their first big break when Train's frontman fell sick just prior to the Bite of Las Vegas Festival. Imagine Dragons were called to fill in for them and performed in front of a crowd of more than 26,000 people. In November 2011, they signed with Interscope Records and began working with Grammy award-winning producer Alex da Kid.\n  \n  Imagine Dragons released their debut studio album Night Visions on September 4, 2012. The album was preceded by their first single \"It's Time\", released on August 18, 2012. Night Visions charted in the top ten albums in the U.S. in 2012, 2013, and 2014. It won a Billboard Music Award for Top Rock Album and was nominated for a Juno Award for International Album of the Year. The album's second single, \"Radioactive\", reached #3 on the Billboard Hot 100. \"Radioactive\" set the all-time record for the longest reign at the top of the Billboard Rock Songs chart, with 23 consecutive weeks and the all-time record for longest run on the Billboard Hot 100, with 87 weeks. Rolling Stone called it \"the biggest rock hit of the year\". It is the best-selling rock song in digital history, with sales of more than 7.5 million copies in the United States, and was certified diamond by the RIAA. The third single, \"Demons\", reached #6 on the Billboard Hot 100 and is the eighth best-selling rock song in digital history with sales in excess of 5 million copies in the United States. Imagine Dragons were nominated for two Grammy Awards, Record of the Year and Best Rock Performance, the latter of which they won. They also won two AMAs for Favorite Alternative Artist, a Teen Choice Award for Choice Rock Group, a World Music Award for World's Best Rock Act, and a Billboard Music Award for Top Rock Artist. The band made their major festival headlining debut at the Made In America Music Festival in 2014 and also drew large crowds and positive reviews at festivals such as Lollapalooza Brazil in 2014.\nImagine Dragons released their second album, Smoke + Mirrors, in February 2015. Smoke + Mirrors debuted at number one on the Billboard 200, UK Albums Chart, and Canadian Albums Chart. Two of the album's four singles, \"I Bet My Life\" and \"Shots\", charted on the Billboard Hot 100.\n\n  Imagine Dragons released their third album Evolve on June 23, 2017. Evolve debuted at number two on the Billboard 200 and number one on the Canadian Albums Chart. Singles \"Believer\", \"Thunder\", and \"Whatever It Takes\", each of which have charted at number 4, number 4, and number 12 on the Billboard Hot 100, respectively. Believer topped the Billboard Hot Rock Songs (29 weeks), Alternative Songs (13 weeks), and Adult Top 40 charts. Thunder also topped the Billboard Hot Rock Songs (22 weeks so far) and Alternative Songs chart (3 weeks so far), as well as the Mainstream Top 40 chart. Whatever It Takes topped the Billboard Rock Songs chart (17 weeks so far) and Alternative Songs chart (3 weeks). In 2018, the band was nominated for two more Grammy Awards and received the iHeartRadio Music Award for Alternative Rock Artists of the Year."}}}